app/controllers/comments_controller.rb

SELECT  "teams".* FROM "teams" ORDER BY "teams"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "videos".* FROM "videos" ORDER BY "videos"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "team_id", "video_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "Comment 01"], ["user_id", 1], ["team_id", 1], ["video_id", 1], ["created_at", "2018-08-21 19:37:08.941847"], ["updated_at", "2018-08-21 19:37:08.941847"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.team_id = Team.first.id
    @comment.user_id = User.first.id
    @comment.video_id = Video.first.id
    @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @comment = Comment.find(params[:id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @comment = Comment.find(params[:id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "test comment edited"], ["updated_at", "2018-08-17 23:53:03.145757"], ["id", 2]]
---
  def update
    @comment = Comment.find(params[:id])
    @comment.update(comment_params)