app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects" ORDER BY "projects"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "projects" ("project_name", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["project_name", "test new project"], ["team_id", 1], ["created_at", "2018-08-21 17:12:08.036102"], ["updated_at", "2018-08-21 17:12:08.036102"]]
---
  def create
    @project = Project.new(project_params)
    @project.team_id = Project.first.id
    @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @project = Project.find(params[:id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "projects" SET "project_name" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["project_name", "third project edted"], ["updated_at", "2018-08-17 23:55:14.250460"], ["id", 3]]
---
  def update
    @project = Project.find(params[:id])
    @project.update(project_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 11]]
---
  def destroy
    @project = Project.find(params[:id])
    @project.destroy