app/controllers/teams_controller.rb

SELECT  "teams".* FROM "teams" ORDER BY "teams"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @teams = Team.all

INSERT INTO "teams" ("team_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["team_name", "Team 02"], ["created_at", "2018-08-21 19:56:51.393619"], ["updated_at", "2018-08-21 19:56:51.393619"]]
---
  def create
    @team = Team.new(team_params)
    @team.save

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @team = Team.find(params[:id])

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 6]]
---
  def destroy
    @team = Team.find(params[:id])
    @team.destroy