app/controllers/videos_controller.rb

  def create
    @video = Video.new(video_params)
    @video.user_id = User.first.id
    @video.project_id = Project.first.id
    @video.team_id = Team.first.id
    @video.save
---
SELECT "videos".* FROM "videos" WHERE "videos"."user_id" = ?  [["user_id", 1]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "projects".* FROM "projects" ORDER BY "projects"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "videos".* FROM "videos" LIMIT ?  [["LIMIT", 11]]
SELECT  "teams".* FROM "teams" ORDER BY "teams"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "videos" ("url", "video_name", "user_id", "team_id", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    @video = Video.find(params[:id])
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def destroy
    @video = Video.find(params[:id])
    @video.destroy
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "videos" WHERE "videos"."id" = ?  [["id", 6]]